In [1]:
import pandas as pd
from sklearn import linear_model

In [2]:
df = pd.read_csv('hiring.csv')
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [3]:
df.shape

(8, 4)

In [4]:
df.isnull().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

# Remove null values

In [5]:
df.dropna(inplace = True)

In [6]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
7        11.0                    7.0                           8      80000

# split the data

In [7]:
x = x = df.drop('salary($)',axis = 'columns')
x

   experience  test_score(out of 10)  interview_score(out of 10)
2         5.0                    6.0                           7
3         2.0                   10.0                          10
4         7.0                    9.0                           6
5         3.0                    7.0                          10
7        11.0                    7.0                           8

In [8]:
y = df['salary($)']
y

2    60000
3    65000
4    70000
5    62000
7    80000
Name: salary($), dtype: int64

# linear Regression

In [9]:
reg = linear_model.LinearRegression()
reg

LinearRegression()

# fit the model

In [10]:
reg.fit(x,y)

LinearRegression()

# predict problem 1

# exp - 2 ,test score - 9 , interview score - 6

In [12]:
reg.predict([[2,9,6]])

array([56365.37746374])

#  predict problem 2

# exp - 12 ,test score - 10 , interview score - 10

In [13]:
reg.predict([[12,10,10]])

array([92146.52287096])

# verify

#  y = m1 x1 + m2 x2 + m3 x3 +b

In [14]:
# slope - m
reg.coef_

array([2701.56191893, 2006.879881  , 1689.66158423])

In [15]:
# intercept - b
reg.intercept_

22762.365191520978

In [16]:
# problem 1 - 2,9,6

2701.56191893 * 2 + 2006.879881 * 9 + 1689.66158423 * 6 + 22762.365191520978

56365.377463760975

In [17]:
# problem 2 - 12,10,10

2701.56191893 * 12 + 2006.879881 * 10 + 1689.66158423 * 10 + 22762.365191520978

92146.52287098099